Autodesk.Revit.Exceptions.DirectoryNotEmptyException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.DirectoryNotEmptyException
The exception that is thrown when a method received a directory as an argument and
requires that the directory be empty but the directory is not empty.
Since: 2024